line = input("Введіть рядок з 15 символів: ")
if len(line) <= 0:
    print("Завершення роботи у зв'язку з тим, що рядок пустий")

while len(line) < 15:
    line = (line * 2)
    
if len(line) >= 15:
    line = list(line)
    print("Повний список: ", line)
    print("Останні 5 елементів зі списку: ", line[-5:])
    print("В зворотній послідовності: ", line[::-1])
    print("Усі елементи з парними індексами: ", line[1::2])
    print("Елементи списку без 2 перших елементів і без 2 останніх: ", line[2:-2])
    line[0:5] = line[-5:]
    print("Список, у якому 5 елементів спочатку, такі ж самі як останні 5 елементів списку: ", line)