print("Це Григоріанський календар")
age = int(
    input("Введіть рік: ")
    )
if 1900 < age < 1000000 and ((age % 4) == 0) and ((age % 400) == 0):
    print("Це високосний рік")
elif 1900 < age < 1000000 and ((age % 100) == 0):
    print("Це не високосний рік")
elif 1900 < age < 1000000 and ((age % 4) != 0) and ((age % 400) == 0):
    print("Це не високосний рік")
elif 1900 < age < 1000000 and ((age % 4) == 0) and ((age % 400) != 0):
    print("Це не високосний рік")
elif 1900 < age < 1000000 and ((age % 4) != 0) and ((age % 400) != 0):
    print("Це не високосний рік")
else:
    print("Рік не відповідає умовам")
