N = int(input("Введіть будь-яке число: "))

for i in range(1, N):

    if (((i ** 2) % 10) == i) and (i ** 2) < 100:
        print(i, "*", i, "=", (i ** 2))
    if (((i ** 2) % 100) == i) and 100 < (i ** 2) < 10000:
        print(i, "*", i, "=", (i ** 2))  
    if (((i ** 2) % 1000) == i) and 10000 < (i ** 2) < 1000000:
        print(i, "*", i, "=", (i ** 2))
    if (((i ** 2) % 10000) == i) and 1000000 < (i ** 2) < 100000000:
        print(i, "*", i, "=", (i ** 2))
    if (((i ** 2) % 100000) == i) and 100000000 < (i ** 2) < 10000000000:
        print(i, "*", i, "=", (i ** 2))
    if ((i + 1) ** 2) < N:
        i += 1 
        
    else:
        break